DeleteMass
Syntax
SapObject.SapModel.PointObj.DeleteMass
VB6 Procedure
Function DeleteMass(ByVal Name As String, Optional ByVal ItemType As eItemType = Object) As Long
Parameters
Name
The name of a point object or a group depending on the value selected for ItemType item.
ItemType
This is one of the following items from the eItemType enumeration.
Object = 0
Group = 1
SelectedObjects = 2
If Object is selected, the Name item refers to a point object. The mass assignments for that point object are removed.
If Group is selected, the Name item refers to a group. The mass assignments for all point objects in the group are removed.
If SelectedObjects is selected, the Name item is ignored. The mass assignments for all selected point objects are removed.
Remarks
This function deletes all mass assignments from the specified point object(s).
The function returns zero if the mass assignments are successfully deleted, otherwise it returns a nonzero value.
VBA Example
Sub DeletePointMass()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret as Long
 Dim Value() As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 3, 124, 3, 200)
 'add point mass
 Redim Value(5)
 Value(0) = 1
 ret = SapModel.PointObj.SetMass("3", Value)
 'delete point mass
 ret = SapModel.PointObj.DeleteMass("3")
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
See Also
GetMass
SetMass
SetMassByVolume
SetMassByWeight